#+TITLE: Acksin Autotune
#+AUTHOR: Acksin
#+OPTIONS: html-postamble:nil body-only: t

#+begin_quote

#+end_quote

** Environment Variable Changes

 #+begin_src sh :results output code :exports both
 autotune env golang
 #+end_src

 #+RESULTS:
 #+BEGIN_SRC sh
#+END_SRC

 #+RESULTS:

#+begin_src ruby :results output drawer :exports results
  require 'json'

  sigs = JSON.parse(`./autotune list`)

  ["Open"].each do |st|
    puts "* #{st} Signatures"

    sigs[st].each do |s|
      sigInfo = JSON.parse(`./autotune sig #{s}`)

      puts "** #{sigInfo["Name"]}"
      puts
      puts sigInfo["Documentation"]
      puts

      ["ProcFS", "SysFS", "Env", "Files"].each do |type|
        if !!sigInfo[type]
          puts "*** #{type}"
          puts
          puts "#+ATTR_HTML: :class table"
          puts "|#{type} Key|Description|"
          puts "| <10> |||" if type == "Env"
          sigInfo[type].each do |k, v|
            puts "|=#{k}=|#{v["Description"].gsub("\n", ' ') rescue ""}|"
          end
        end
      end

      if !!sigInfo["Deps"] && !sigInfo["Deps"].empty?
        puts "*** Dependencies"
        puts
        sigInfo["Deps"].each do |k|
          puts " - [[#{k}][#{k}]]"
        end
        puts
      end

      if !!sigInfo["References"] && !sigInfo["References"].empty?
        puts "*** References"
        puts
        sigInfo["References"].each do |k|
          puts " - [[#{k}][#{k}]]"
        end
        puts
      end
    end
  end
#+end_src

#+RESULTS:
:RESULTS:
